In [1]:
imprt numpy as np

SyntaxError: invalid syntax (<ipython-input-1-c7cfea7870aa>, line 1)

In [2]:
import numpy as np
import pandas as pd

In [4]:
pd

In [5]:
pwd

'/home/trolaf/Desktop/projects/Untitled Folder'

In [6]:
df = pd.read_csv('example')

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df.to_csv('example_1', index=False)

In [11]:
df = pd.read_csv('example')

In [13]:
pd.read_csv('example_1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [16]:
conda install lxml

WARNING: The conda.compat module is deprecated and will be removed in a future release.
Collecting package metadata: failed

CondaHTTPError: HTTP 000 CONNECTION FAILED for url <https://repo.anaconda.com/pkgs/r/linux-64/repodata.json.bz2>
Elapsed: -

An HTTP error occurred when trying to retrieve this URL.
HTTP errors are often intermittent, and a simple retry will get you on your way.

If your current network has https://www.anaconda.com blocked, please file
a support request with your network engineering team.

ConnectionError(MaxRetryError("HTTPSConnectionPool(host='repo.anaconda.com', port=443): Max retries exceeded with url: /pkgs/r/linux-64/repodata.json.bz2 (Caused by NewConnectionError('<urllib3.connection.VerifiedHTTPSConnection object at 0x7f0834f98828>: Failed to establish a new connection: [Errno -3] Temporary failure in name resolution'))"))



Note: you may need to restart the kernel to use updated packages.

In [17]:
from sqlalchemy import create_engine

In [18]:
engine = create_engine('sqlite:///:memory:')

In [19]:
df.to_sql('data',con=engine)

In [21]:
sql_df = pd.read_sql('data',con=engine)

In [22]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15